-- phpMyAdmin SQL Dump
-- version 4.9.2
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1:3306
-- Generation Time: 11 มิ.ย. 2021 เมื่อ 10:37 AM
-- เวอร์ชันของเซิร์ฟเวอร์: 10.4.10-MariaDB
-- PHP Version: 5.6.40

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `stock`
--

-- --------------------------------------------------------

--
-- โครงสร้างตาราง `project`
--

DROP TABLE IF EXISTS `project`;
CREATE TABLE IF NOT EXISTS `project` (
  `pid` int(11) NOT NULL AUTO_INCREMENT,
  `recid` int(11) NOT NULL,
  `name` varchar(200) NOT NULL,
  `money` int(10) NOT NULL COMMENT 'งบประมาณ',
  `yid` int(11) NOT NULL,
  `uid` varchar(150) NOT NULL,
  `owner` varchar(20) NOT NULL COMMENT 'แหล่งงบประมาณ',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `del` int(10) NOT NULL DEFAULT 1,
  `subcontact` text NOT NULL COMMENT 'หน่วยดำเนินการร่วม',
  PRIMARY KEY (`pid`)
) ENGINE=InnoDB AUTO_INCREMENT=79 DEFAULT CHARSET=utf8;

--
-- dump ตาราง `project`
--

INSERT INTO `project` (`pid`, `recid`, `name`, `money`, `yid`, `uid`, `owner`, `created_at`, `del`, `subcontact`) VALUES
(11, 1, 'โครงการพัฒนาอุตสาหกรรมท่องเที่ยวเชิงอนุรักษ์เข้มแข็งสู่ประชาคมอาเซียน', 0, 6, '10', 'งบจังหวัด', '2020-10-13 17:00:00', 1, 'data'),
(12, 2, 'โครงการผลผลิตทางการเกษตรขับเคลื่อนเศรษฐกิจเข้มแข็ง', 0, 7, '24', 'งบจังหวัด', '2020-10-13 17:00:00', 1, 'data'),
(13, 1, 'สนับสนุนอุปกรณ์สำรวจความพึงพอใจผู้รับบริการ', 350000, 6, '1', 'งบจังหวัด', '2020-10-15 11:11:04', 1, 'data'),
(14, 2, 'โครงการพัฒนาระบบการสื่อสารระหว่างส่วนราชการจังหวัดพัทลุง', 150000, 6, '1', 'งบจังหวัด', '2020-10-16 08:34:46', 1, 'data'),
(15, 3, 'โครงการซื้อวิทยุสื่อสาร', 300000, 6, '1', 'งบจังหวัด', '2020-10-20 08:26:46', 1, 'data'),
(16, 4, 'โครงการเกษตรเพื่อความมั่นคงทางอาหารและการพึ่งพาตนเองอย่างยั่งยืน', 0, 8, '18', 'งบจังหวัด', '2020-10-27 02:30:42', 1, 'data'),
(17, 3, 'โครงการสร้างชุมชนเข้มแข็ง', 0, 6, '7', 'งบจังหวัด', '2020-10-27 04:35:02', 1, 'data'),
(18, 4, 'โครงการอนุรักษ์ฟื้นฟูลุ่มน้ำทะเลสาบสงขลา', 0, 1, '22', 'งบจังหวัด', '2020-10-27 04:36:19', 1, 'data'),
(19, 1, 'โครงการเพิ่มประสิทธิภาพการผลิตปศุสัตว์ ประมงเพื่อความเข้มแข็งและการพึ่งพาตนเองอย่างยั่งยืนตามแนวเศรษฐกิจพอเพียง ', 33184300, 6, '8', 'งบจังหวัด', '2020-10-27 04:38:19', 1, 'data'),
(20, 2, 'โครงการเพิ่มประสิทธิภาพการผลิตพืชเพื่อความมั่นคงทางอาหาร และการพึ่งพาตนเองอย่างยั่งยืน (สนง.เกษตรฯ)', 16904700, 6, '18', 'งบจังหวัด', '2020-10-27 04:52:10', 1, 'data'),
(21, 3, 'โครงการพืชเศรษฐกิจขับเคลื่อนเศรษฐกิจเมืองลุง', 0, 6, '24', 'งบจังหวัด', '2020-10-27 07:02:22', 1, 'data'),
(22, 4, 'โครงการพัฒนาอาชีพและส่งเสริมการจัดตั้งศูนย์การเรียนรู้ด้านพลังงานทดแทน', 0, 2, '12', 'งบจังหวัด', '2020-10-27 07:04:20', 1, 'data'),
(23, 5, 'โครงการยกระดับคุณภาพชีวิตเตรียมคนคุณภาพสู่ประชาคมอาเซียน', 0, 6, '23', 'งบจังหวัด', '2020-10-27 07:05:51', 1, 'data'),
(24, 6, 'โครงการเสริมสร้างชุมชนเข้มแข็งปี 2560', 0, 6, '1', 'งบจังหวัด', '2020-10-27 07:08:31', 1, 'data'),
(25, 7, 'โครงการป้องกันและแก้ไขปัญหาน้ำท่วมและน้ำแล้ง', 0, 6, '16', 'งบจังหวัด', '2020-10-27 07:09:38', 1, 'data'),
(26, 1, 'โครงการสร้างเมืองลุงให้เป็นเมืองเศรษฐกิจทางการเกษตร ระยะที่ 1 ', 28850200, 6, '18', 'งบจังหวัด', '2020-10-27 07:12:05', 1, 'data'),
(27, 2, 'โครงการสร้างเมืองลุงให้มีความมั่นคงอาหาร ระยะที่ 1 ', 4361700, 6, '19', 'งบจังหวัด', '2020-10-27 07:13:49', 1, 'data'),
(28, 3, 'โครงการพัฒนาโครงสร้างพื้นฐานการเกษตรและระบบโลจิสติกส์รองรับการเกษตร', 3480000, 6, '19', 'งบจังหวัด', '2020-10-27 07:15:28', 1, 'data'),
(29, 4, 'โครงการส่งเสริมกิจกรรมการท่องเที่ยว ตามเทศกาลท่องเที่ยวของจังหวัดพัทลุง', 5188600, 6, '18', 'งบจังหวัด', '2020-10-27 07:16:47', 1, 'data'),
(30, 5, 'โครงการพัฒนาศักยภาพคนพัทลุงทุกช่วงวัย ให้พร้อมรับการเปลี่ยนแปลง ', 9358000, 6, '23', 'งบจังหวัด', '2020-10-27 07:18:23', 1, 'data'),
(31, 6, 'โครงการส่งเสริมการท่องเที่ยวลุ่มน้ำทะเลสาบพัทลุง', 2772000, 6, '22', 'งบจังหวัด', '2020-10-27 07:19:27', 1, 'data'),
(32, 7, 'โครงการอนุรักษ์ฟื้นฟูลุ่มน้ำทะเลสาบพัทลุง-สงขลา', 2620000, 6, '22', 'งบจังหวัด', '2020-10-27 07:22:30', 1, 'data'),
(33, 1, 'โครงการเพาะต้นกล้าเสริมสร้างภูมิปัญญากลุ่มผู้ผลิตผ้าเมืองลุง', 1686200, 6, '21', 'งบจังหวัด', '2020-10-27 07:26:40', 1, 'data'),
(34, 2, 'โครงการพัฒนาเมืองเกษตรอุตสาหกรรมสีเขียว', 4190800, 4, '12', 'งบจังหวัด', '2020-10-27 07:29:38', 1, 'data'),
(35, 3, 'โครงการปฏิรูปพืชเศรษฐกิจเพื่อการพึ่งพาตนเองอย่างยั่งยืน', 7126100, 6, '18', 'งบจังหวัด', '2020-10-27 07:30:39', 1, 'data'),
(36, 4, 'โครงการอนุรักษ์ฟื้นฟูทรัพยากรธรรมชาติสิ่งแวดล้อมทะเลสาบและอนุรักษ์สัตว์ทะเลหายาก', 2801400, 6, '20', 'งบจังหวัด', '2020-10-27 07:35:50', 1, 'data'),
(37, 1, 'โครงการผลิตข้าวคุณภาพมาตรฐานอาหารปลอดภัยครบวงจร', 0, 11, '1', 'งบจังหวัด', '2020-10-30 03:33:44', 1, 'data'),
(38, 2, 'โครงการขับเคลื่อนแนวคิดตามปรัชญาเศรษฐกิจพอเพียงในชุมชน', 0, 11, '1', 'งบจังหวัด', '2020-10-30 03:38:31', 1, 'data'),
(39, 1, 'โครงการส่งเสริมและพัฒนาระบบการผลิตด้านการเกษตร', 0, 10, '1', 'งบจังหวัด', '2020-10-30 03:41:40', 1, 'data'),
(40, 1, 'โครงการพัฒนาระบบบริหารจัดการเกษตรสู่มาตรฐานสากล', 0, 8, '19', 'งบจังหวัด', '2020-10-30 03:43:04', 1, 'data'),
(41, 3, 'โครงการสร้างศูนย์รวบรวมน้ำยางจังหวัดพัทลุง', 0, 11, '1', 'งบจังหวัด', '2020-10-30 03:59:01', 1, 'data'),
(42, 1, 'ไม่ทราบชื่อโครงการ', 0, 10, '1', 'งบจังหวัด', '2020-10-30 04:06:13', 1, 'data'),
(43, 4, 'โครงการสร้างศูนย์รวบรวมน้ำยางจังหวัดพัทลุง', 0, 6, '1', 'งบจังหวัด', '2020-10-30 04:15:39', 1, 'data'),
(44, 2, 'โครงการศูนย์รวบรวมสินค้าเกษตรและจัดตั้งตลาดน้ำยางสดระดับท้องถิ่น', 0, 10, '1', 'งบจังหวัด', '2020-10-30 04:28:48', 1, 'data'),
(45, 2, 'โครงการพัฒนาการเกษตรขับเคลื่อนเศรษฐกิจเข้มแข็ง', 0, 7, '24', 'งบจังหวัด', '2020-10-30 04:32:01', 1, 'data'),
(46, 1, 'โครงการเกษตรเพื่อความมั่นคงทางอาหารและการพึ่งพาตนเองอย่างยั่งยืน ', 0, 7, '8', 'งบจังหวัด', '2020-10-30 04:33:34', 1, 'data'),
(47, 3, 'โครงการผลิตข้าวคุณภาพมาตรฐานอาหารปลอดภัย', 0, 10, '1', 'งบจังหวัด', '2020-10-30 07:27:23', 1, 'data'),
(48, 1, 'โครงการเพิ่มขีดความสามารถการแข่งขันแก่ข้าวสังข์หยดเมืองพัทลุง', 0, 9, '19', 'งบจังหวัด', '2020-10-30 07:40:40', 1, 'data'),
(49, 2, 'โครงการขับเคลื่อนแนวคิดตามปรัชญาเศรษฐกิจพอเพียงในชุมชน', 0, 6, '19', 'งบจังหวัด', '2020-10-30 07:43:25', 1, 'data'),
(50, 3, 'โครงการพัฒนากิจการวิสาหกิจชุมชน ', 0, 6, '18', 'งบจังหวัด', '2020-10-30 07:45:17', 1, 'data'),
(51, 4, 'โครงการพัฒนาศักยภาพหน่วยบริการและดำเนินงานสาธารณสุขเชิงรุก จังหวัดพัทลุงปี 2555', 0, 6, '7', 'งบจังหวัด', '2020-11-03 08:08:26', 1, 'data'),
(52, 2, 'โครงการเสริมสร้างชุมชนเข้มแข็งปี 2558 ', 0, 6, '7', 'งบจังหวัด', '2020-11-03 08:12:03', 1, 'data'),
(53, 4, 'โครงการพัฒนาและสร้างเสริมสุขภาพและป้องกันโรคเชิงรุก ปี 2556', 0, 6, '7', 'งบจังหวัด', '2020-11-03 09:08:46', 1, 'data'),
(54, 3, 'โครงการเกษตรเพื่อความมั่นคงทางอาหารและการพึ่งพาตนเองอย่างยั่งยืน พ.ศ. 2557', 0, 8, '0', 'งบจังหวัด', '2020-11-03 09:14:30', 1, 'data'),
(55, 4, 'โครงการเสริมสร้างชุมชนเข้มแข็งปี 2557', 0, 6, '7', 'งบจังหวัด', '2020-11-03 09:19:17', 1, 'data'),
(56, 5, 'โครงการหมู่บ้านท่องเที่ยววัฒนธรรมจังหวัดพัทลุง', 0, 6, '1', 'งบจังหวัด', '2020-11-03 09:56:00', 1, 'data'),
(57, 5, 'โครงการพัฒนาอุตสาหกรรมการท่องเที่ยวเชิงอนุรักษ์เข้มแข็ง เพื่อเข้าสู่ประชาคมอาเซียน', 0, 6, '1', 'งบจังหวัด', '2020-11-03 10:01:16', 1, 'data'),
(58, 3, 'โครงการผลผลิตทางการเกษตรขับเคลื่อนเศรษฐกิจเข้มแข็ง', 0, 6, '18', 'งบจังหวัด', '2020-11-04 09:16:38', 1, 'data'),
(59, 6, 'โครงการบริหารจัดการคลองเฉลิมพระเกียรติเนื่องในโอกาสมหามงคลพระราชพิธีบรมราชาภิเษก (ร่มเมือง-ลำปำ) อำเภอเมือง จังหวัดพัทลุง', 411200, 6, '17', 'งบจังหวัด', '2020-11-10 09:11:51', 1, 'data'),
(60, 7, 'โครงการพัฒนาศักยภาพหน่วยบริการสาธารณสุขรองรับการเฝ้าระวังกลุ่มอาการคล้ายไข้หวัดใหญ่และการระบาดของไวรัสโคโรนาสายพันธุ์ใหม่ 2019 และการช่วยเหลือผู้ป่วยฉุกเฉิน', 300000, 5, '7', 'งบจังหวัด', '2020-11-10 09:14:35', 1, 'data'),
(61, 8, 'โครงการติดตั้งป้ายจราจร', 225767, 6, '15', 'งบจังหวัด', '2020-11-10 09:16:12', 1, 'data'),
(62, 9, 'โครงการพัทลุงเมืองเกษตรกรรมยั่งยืน', 0, 5, '8', 'งบจังหวัด', '2020-11-10 09:18:25', 1, 'data'),
(63, 5, 'โครงการก่อสร้างระบบสูบน้ำพลังงานแสงอาทิตย์', 481875, 6, '12', 'งบจังหวัด', '2021-01-14 04:24:38', 1, 'data'),
(64, 6, 'โครงการพัฒนาระบบการแพทย์ฉุกเฉินเพื่อรองรับการท่องเที่ยวและพื้นที่เกาะ', 2000000, 6, '16', 'งบกลุ่มจังหวัด', '2021-01-19 08:13:11', 1, 'data'),
(65, 10, 'โครงการพัฒนาเพิ่มประสิทธิภาพระบบงานสื่อสารจังหวัดพัทลุง', 108000, 5, '1', 'งบจังหวัด', '2021-01-25 08:00:46', 1, 'data'),
(66, 11, 'โครงการส่งเสริมและพัฒนาศักยภาพแหล่งท่องเที่ยวจังหวัดพัทลุง', 476000, 5, '12', 'งบจังหวัด', '2021-01-25 08:09:26', 1, 'data'),
(67, 12, 'โครงการพัฒนาคุณภาพและส่งเสริมกิจกรรมท่องเที่ยวชุมชน', 225000, 5, '13', 'งบจังหวัด', '2021-01-25 08:13:52', 1, 'data'),
(68, 13, 'โครงการ Smart OPD โรงพยาบาลเขาชัยสนสำนักงานสาธารณสุขจังหวัดพัทลุง', 8950, 5, '7', 'งบจังหวัด', '2021-01-25 09:13:37', 1, 'data'),
(69, 14, 'โครงการสนับสนุนอุปกรณ์สำรวจความพึงพอใจผู้รับบริการ', 350000, 5, 'กลุ่มงานบริหารทรัพยากรบุคคล สำนักงานจังหวัดพัทลุง', 'งบจังหวัด', '2021-01-26 01:53:25', 0, 'data'),
(70, 13, 'โครงการปรับปรุงสนามกีฬาเพื่อรองรับการแข่งขันกีฬาเยาวชนแห่งชาติปี 2564', 38000, 5, '10', 'งบจังหวัด', '2021-02-09 08:47:36', 1, 'data'),
(71, 2, 'โครงการก่อสร้าง', 500000, 6, '-', 'งบจังหวัด', '2021-02-11 06:50:59', 0, 'data'),
(72, 3, '54', 0, 6, '-', 'งบจังหวัด', '2021-02-11 06:55:54', 0, 'data'),
(73, 8, 'โครงการจัดตั้งห้องปฏิบัติการข้อมูลสาธารณภัย (War Room)', 0, 6, '16', 'งบจังหวัด', '2021-02-15 02:06:36', 1, 'data'),
(74, 14, 'โครงการเพิ่มประสิทธิภาพการผลิตสื่อประชาสัมพันธ์ของจังหวัด', 0, 5, '14', 'งบจังหวัด', '2021-02-15 02:20:32', 1, 'data'),
(75, 9, 'โครงการเพิ่มศักยภาพในการบริหารงานสำนักงานจังหวัดพัทลุง', 22000, 5, '1', 'งบจังหวัด', '2021-02-15 02:57:47', 1, 'data'),
(76, 52, 'xxxxxxx', 500000, 6, '2', 'งบจังหวัด', '2021-03-03 01:46:27', 0, 'data'),
(77, 53, 'test3', 50000, 6, '15', 'งบจังหวัด', '2021-03-03 01:49:56', 0, 'data'),
(78, 41, 'โครงการทำงาน', 500000, 8, '9', 'งบจังหวัด', '2021-06-11 10:26:07', 1, 'data');
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
